WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/DocLitW/SoapWsdl.BaseDataTypes.XmlFormatter.DocLitWrapped_RetFloat_Client_Request-11.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesDocLitW/RetFloat</a:Action>
    <a:MessageID>urn:uuid:5d78e655-4e51-48a3-b90a-04447e466eae</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetFloat xmlns="http://tempuri.org/">
      <inFloat>-3.14159274</inFloat>
    </RetFloat>
  </s:Body>
</s:Envelope>